jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 *
 *  Copyright (C) 2008-2010 by Witz Corporation, JAPAN
 *
 *  上記著作権者は，以下の(1)～(4)の条件を満たす場合に限り，本ソフトウェ
 *  ア（本ソフトウェアを改変したものを含む．以下同じ）を使用・複製・改
 *  変・再配布（以下，利用と呼ぶ）することを無償で許諾する．
 *  (1) 本ソフトウェアをソースコードの形で利用する場合には，上記の著作
 *      権表示，この利用条件および下記の無保証規定が，そのままの形でソー
 *      スコード中に含まれていること．
 *  (2) 本ソフトウェアを，ライブラリ形式など，他のソフトウェア開発に使
 *      用できる形で再配布する場合には，再配布に伴うドキュメント（利用
 *      者マニュアルなど）に，上記の著作権表示，この利用条件および下記
 *      の無保証規定を掲載すること．
 *  (3) 本ソフトウェアを，機器に組み込むなど，他のソフトウェア開発に使
 *      用できない形で再配布する場合には，次のいずれかの条件を満たすこ
 *      と．
 *    (a) 再配布に伴うドキュメント（利用者マニュアルなど）に，上記の著
 *        作権表示，この利用条件および下記の無保証規定を掲載すること．
 *    (b) 再配布の形態を，別に定める方法によって，TOPPERSプロジェクトに
 *        報告すること．
 *  (4) 本ソフトウェアの利用により直接的または間接的に生じるいかなる損
 *      害からも，上記著作権者およびTOPPERSプロジェクトを免責すること．
 *      また，本ソフトウェアのユーザまたはエンドユーザからのいかなる理
 *      由に基づく請求からも，上記著作権者およびTOPPERSプロジェクトを
 *      免責すること．
 *
 *  本ソフトウェアは，無保証で提供されているものである．上記著作権者お
 *  よびTOPPERSプロジェクトは，本ソフトウェアに関して，特定の使用目的
 *  に対する適合性も含めて，いかなる保証も行わない．また，本ソフトウェ
 *  アの利用により直接的または間接的に生じたいかなる損害に関しても，そ
 *  の責任を負わない．
 *
 */

/*
 *  RX62Tに依存する定義
 */
#ifndef TOPPERS_RX62T_H
#define TOPPERS_RX62T_H

/*
 *  CPU例外ハンドラ番号の定義(固定ベクタテーブル)
 *
 *  番号の範囲は0 - 31
 */
#define INT_PRIVILEGED_INSTRUNCTION		20		/* 特権命令例外 */
#define INT_UNDEF_INSTRUNCTION			23		/* 未定義命令例外 */
#define INT_FLOATINGPOINT_INSTRUCTION	25		/* 浮動小数点例外 */
#define INT_NMI							30		/* ノンマスカブル割り込み */
#define INT_RESET						31		/* リセット */

/*
 *  割込み番号の定義(可変ベクタテーブル)
 */
#define INT_BUSERR			            16
#define INT_FCU_FCUERR		            21
#define INT_FCU_FRDYI		            23
#define INT_ICU_SWINT		            27
#define INT_CMT0_CMI		            28
#define INT_CMT1_CMI		            29
#define INT_CMT2_CMI		            30
#define INT_CMT3_CMI		            31
#define INT_IRQ0			            64
#define INT_IRQ1			            65
#define INT_IRQ2			            66
#define INT_IRQ3			            67
#define INT_IRQ4			            68
#define INT_IRQ5			            69
#define INT_IRQ6			            70
#define INT_IRQ7			            71
#define INT_WDT_WOVI		            96
#define INT_AD0_ADI0		            98
#define INT_S12AD0_S12ADI0	            102
#define INT_S12AD1_S12ADI1	            103
#define INT_TPU0_TGI0A		            114
#define INT_TPU0_TGI0B		            115
#define INT_TPU0_TGI0C		            116
#define INT_TPU0_TGI0D		            117
#define INT_TPU0_TCI0V		            118
#define INT_TPU0_TGI0E		            119
#define INT_TPU0_TGI0F		            120
#define INT_TPU1_TGI1A		            121
#define INT_TPU1_TGI1B		            122
#define INT_TPU1_TCI1V		            123
#define INT_TPU1_TCI1U		            124
#define INT_TPU2_TGI2A		            125
#define INT_TPU2_TGI2B		            126
#define INT_TPU2_TCI2V		            127
#define INT_TPU2_TCI2U		            128
#define INT_TPU3_TGI3A		            129
#define INT_TPU3_TGI3B		            130
#define INT_TPU3_TGI3C		            131
#define INT_TPU3_TGI3D		            132
#define INT_TPU3_TCI3V		            133
#define INT_TPU4_TGI4A		            134
#define INT_TPU4_TGI4B		            135
#define INT_TPU4_TGI4C		            136
#define INT_TPU4_TGI4D		            137
#define INT_TPU4_TCI4V		            138
#define INT_TPU5_TGI5U		            139
#define INT_TPU5_TGI5V		            140
#define INT_TPU5_TGI5W		            141
#define INT_TPU6_TGI6A		            142
#define INT_TPU6_TGI6B		            143
#define INT_TPU6_TGI6C		            144
#define INT_TPU6_TGI6D		            145
#define INT_TPU6_TCI6V		            146
#define INT_TPU7_TGI7A		            149
#define INT_TPU7_TGI7B		            150
#define INT_TPU7_TGI7C		            151
#define INT_TPU7_TGI7D		            152
#define INT_TPU7_TGI7V		            153
#define INT_SCI0_ERI		            214
#define INT_SCI0_RXI		            215
#define INT_SCI0_TXI		            216
#define INT_SCI0_TEI		            217
#define INT_SCI1_ERI		            218
#define INT_SCI1_RXI		            219
#define INT_SCI1_TXI		            220
#define INT_SCI1_TEI		            221
#define INT_SCI2_ERI		            222
#define INT_SCI2_RXI		            223
#define INT_SCI2_TXI		            224
#define INT_SCI2_TEI		            225
#define INT_RIIC0_EEI		            246
#define INT_RIIC0_RXI		            247
#define INT_RIIC0_TXI		            248
#define INT_RIIC0_TEI		            249

/*
 *  各モジュールのレジスタ及び設定ビット情報
 */
/*
 * モジュールストップコントロールレジスタA（MSTPCRA）
 */
#define SYSTEM_MSTPCRA_ADDR			    ( ( volatile uint32_t __evenaccess * )0x00080010 )
#define SYSTEM_MSTPCRA_MSTPA7_BIT	    ( 1UL << 7U )
#define SYSTEM_MSTPCRA_MSTPA9_BIT	    ( 1UL << 9U )
#define SYSTEM_MSTPCRA_MSTPA14_BIT	    ( 1UL << 14U )
#define SYSTEM_MSTPCRA_MSTPA15_BIT	    ( 1UL << 15U )
#define SYSTEM_MSTPCRA_MSTPA16_BIT	    ( 1UL << 16U )
#define SYSTEM_MSTPCRA_MSTPA17_BIT	    ( 1UL << 17U )
#define SYSTEM_MSTPCRA_MSTPA23_BIT	    ( 1UL << 23U )
#define SYSTEM_MSTPCRA_MSTPA24_BIT	    ( 1UL << 24U )
#define SYSTEM_MSTPCRA_MSTPA28_BIT	    ( 1UL << 28U )
#define SYSTEM_MSTPCRA_ACSE_BIT		    ( 1UL << 31U)

/*
 * モジュールストップコントロールレジスタB（MSTPCRB）
 */
#define SYSTEM_MSTPCRB_ADDR			    ( ( volatile uint32_t __evenaccess * )0x00080014 )
#define SYSTEM_MSTPCRB_MSTPB0_BIT	    ( 1UL << 0U )
#define SYSTEM_MSTPCRB_MSTPB7_BIT	    ( 1UL << 7U )
#define SYSTEM_MSTPCRB_MSTPB17_BIT	    ( 1UL << 17U )
#define SYSTEM_MSTPCRB_MSTPB21_BIT	    ( 1UL << 21U )
#define SYSTEM_MSTPCRB_MSTPB23_BIT	    ( 1UL << 23U )
#define SYSTEM_MSTPCRB_MSTPB29_BIT	    ( 1UL << 29U )
#define SYSTEM_MSTPCRB_MSTPB30_BIT	    ( 1UL << 30U )
#define SYSTEM_MSTPCRB_MSTPB31_BIT	    ( 1UL << 31U )

/*
 * モジュールストップコントロールレジスタC（MSTPCRC）
 */
#define SYSTEM_MSTPCRC_ADDR			    ( ( volatile uint32_t __evenaccess * )0x00080018 )
#define SYSTEM_MSTPCRC_MSTPC0_BIT	    ( 1UL << 0U )

/*
 * EXTAL clock SCKCR
 */
#define SYSTEM_SCKCR_ADDR			    ( ( volatile uint32_t __evenaccess * )0x00080020 )


/*
 * 割り込み要求レジスタ
 */
#define ICU_IR016_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087010 )
#define ICU_IR021_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087015 )
#define ICU_IR023_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087017 )
#define ICU_IR027_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008701B )
#define ICU_IR028_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008701C )
#define ICU_IR029_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008701D )
#define ICU_IR030_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008701E )
#define ICU_IR031_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008701F )
#define ICU_IR044_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008702C )
#define ICU_IR045_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008702D )
#define ICU_IR046_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008702E )
#define ICU_IR047_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008702F )
#define ICU_IR056_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087038 )
#define ICU_IR057_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087039 )
#define ICU_IR058_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008703A )
#define ICU_IR059_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008703B )
#define ICU_IR060_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008703C )
#define ICU_IR064_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087040 )
#define ICU_IR065_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087041 )
#define ICU_IR066_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087042 )
#define ICU_IR067_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087043 )
#define ICU_IR068_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087044 )
#define ICU_IR069_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087045 )
#define ICU_IR070_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087046 )
#define ICU_IR071_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087047 )
#define ICU_IR096_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087060 )
#define ICU_IR098_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087062 )
#define ICU_IR102_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087066 )
#define ICU_IR103_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087067 )
#define ICU_IR106_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008706A )
#define ICU_IR114_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087072 )
#define ICU_IR115_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087073 )
#define ICU_IR116_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087074 )
#define ICU_IR117_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087075 )
#define ICU_IR118_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087076 )
#define ICU_IR119_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087077 )
#define ICU_IR120_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087078 )
#define ICU_IR121_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087079 )
#define ICU_IR122_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707A )
#define ICU_IR123_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707B )
#define ICU_IR124_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707C )
#define ICU_IR125_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707D )
#define ICU_IR126_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707E )
#define ICU_IR127_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008707F )
#define ICU_IR128_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087080 )
#define ICU_IR129_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087081 )
#define ICU_IR130_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087082 )
#define ICU_IR131_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087083 )
#define ICU_IR132_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087084 )
#define ICU_IR133_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087085 )
#define ICU_IR134_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087086 )
#define ICU_IR135_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087087 )
#define ICU_IR136_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087088 )
#define ICU_IR137_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087089 )
#define ICU_IR138_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708A )
#define ICU_IR139_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708B )
#define ICU_IR140_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708C )
#define ICU_IR141_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708D )
#define ICU_IR142_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708E )
#define ICU_IR143_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008708F )
#define ICU_IR144_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087090 )
#define ICU_IR145_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087091 )
#define ICU_IR146_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087092 )
#define ICU_IR149_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087095 )
#define ICU_IR150_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087096 )
#define ICU_IR151_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087097 )
#define ICU_IR152_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087098 )
#define ICU_IR153_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087099 )
#define ICU_IR170_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AA )
#define ICU_IR171_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AB )
#define ICU_IR172_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AC )
#define ICU_IR173_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AD )
#define ICU_IR174_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AE )
#define ICU_IR175_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870AF )
#define ICU_IR176_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B0 )
#define ICU_IR177_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B1 )
#define ICU_IR178_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B2 )
#define ICU_IR179_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B3 )
#define ICU_IR180_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B4 )
#define ICU_IR181_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B5 )
#define ICU_IR182_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B6 )
#define ICU_IR183_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B7 )
#define ICU_IR184_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870B8 )
#define ICU_IR186_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870BA )
#define ICU_IR187_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870BB )
#define ICU_IR188_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870BC )
#define ICU_IR189_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870BD )
#define ICU_IR190_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870BE )
#define ICU_IR192_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870C0 )
#define ICU_IR193_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870C1 )
#define ICU_IR194_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870C2 )
#define ICU_IR195_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870C3 )
#define ICU_IR196_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870C4 )
#define ICU_IR214_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870D6 )
#define ICU_IR215_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870D7 )
#define ICU_IR216_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870D8 )
#define ICU_IR217_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870D9 )
#define ICU_IR218_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DA )
#define ICU_IR219_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DB )
#define ICU_IR220_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DC )
#define ICU_IR221_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DD )
#define ICU_IR222_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DE )
#define ICU_IR223_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870DF )
#define ICU_IR224_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870E0 )
#define ICU_IR225_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870E1 )
#define ICU_IR246_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870F6 )
#define ICU_IR247_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870F7 )
#define ICU_IR248_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870F8 )
#define ICU_IR249_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870F9 )
#define ICU_IR254_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000870FE )
#define ICU_IR_BIT				        ( 1U << 0U )

