jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 * 割り込み要求先設定レジスタ
 */
#define ICU_ISELR027_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008711B )
#define ICU_ISELR028_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008711C )
#define ICU_ISELR029_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008711D )
#define ICU_ISELR030_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008711E )
#define ICU_ISELR031_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008711F )
#define ICU_ISELR045_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008712D )
#define ICU_ISELR046_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008712E )
#define ICU_ISELR064_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087140 )
#define ICU_ISELR065_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087141 )
#define ICU_ISELR066_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087142 )
#define ICU_ISELR067_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087143 )
#define ICU_ISELR068_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087144 )
#define ICU_ISELR069_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087145 )
#define ICU_ISELR070_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087146 )
#define ICU_ISELR071_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087147 )
#define ICU_ISELR098_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087162 )
#define ICU_ISELR102_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087166 )
#define ICU_ISELR103_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087167 )
#define ICU_ISELR106_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008716A )
#define ICU_ISELR114_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087172 )
#define ICU_ISELR115_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087173 )
#define ICU_ISELR116_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087174 )
#define ICU_ISELR117_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087175 )
#define ICU_ISELR121_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087179 )
#define ICU_ISELR122_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008717A )
#define ICU_ISELR125_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008717D )
#define ICU_ISELR126_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008717E )
#define ICU_ISELR129_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087181 )
#define ICU_ISELR130_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087182 )
#define ICU_ISELR131_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087183 )
#define ICU_ISELR132_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087184 )
#define ICU_ISELR134_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087186 )
#define ICU_ISELR135_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087187 )
#define ICU_ISELR136_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087188 )
#define ICU_ISELR137_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087189 )
#define ICU_ISELR138_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718A )
#define ICU_ISELR139_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718B )
#define ICU_ISELR140_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718C )
#define ICU_ISELR141_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718D )
#define ICU_ISELR142_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718E )
#define ICU_ISELR143_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008718F )
#define ICU_ISELR144_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087190 )
#define ICU_ISELR145_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087191 )
#define ICU_ISELR149_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087195 )
#define ICU_ISELR150_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087196 )
#define ICU_ISELR151_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087197 )
#define ICU_ISELR152_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087198 )
#define ICU_ISELR153_ADDR		        ( ( volatile uint8_t __evenaccess * )0x00087199 )
#define ICU_ISELR174_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871AE )
#define ICU_ISELR175_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871AF )
#define ICU_ISELR176_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B0 )
#define ICU_ISELR177_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B1 )
#define ICU_ISELR178_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B2 )
#define ICU_ISELR179_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B3 )
#define ICU_ISELR180_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B4 )
#define ICU_ISELR181_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B5 )
#define ICU_ISELR182_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B6 )
#define ICU_ISELR183_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B7 )
#define ICU_ISELR184_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871B8 )
#define ICU_ISELR186_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871BA )
#define ICU_ISELR187_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871BB )
#define ICU_ISELR188_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871BC )
#define ICU_ISELR189_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871BD )
#define ICU_ISELR190_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871BE )
#define ICU_ISELR192_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871C0 )
#define ICU_ISELR193_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871C1 )
#define ICU_ISELR194_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871C2 )
#define ICU_ISELR195_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871C3 )
#define ICU_ISELR196_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871C4 )
#define ICU_ISELR215_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871D7 )
#define ICU_ISELR216_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871D8 )
#define ICU_ISELR219_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871DB )
#define ICU_ISELR220_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871DC )
#define ICU_ISELR223_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871DF )
#define ICU_ISELR224_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871E0 )
#define ICU_ISELR247_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871F7 )
#define ICU_ISELR248_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871F8 )
#define ICU_ISELR254_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000871FE )
#define ICU_ISEL_BIT			        ( 3U << 0U )

