jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 * 割り込み要求許可レジスタ
 */
#define ICU_IER02_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087202 )
#define ICU_IER03_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087203 )
#define ICU_IER05_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087205 )
#define ICU_IER07_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087207 )
#define ICU_IER08_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087208 )
#define ICU_IER0C_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008720C )
#define ICU_IER0D_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008720D )
#define ICU_IER0E_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008720E )
#define ICU_IER0F_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008720F )
#define ICU_IER10_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087210 )
#define ICU_IER11_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087211 )
#define ICU_IER12_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087212 )
#define ICU_IER13_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087213 )
#define ICU_IER15_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087215 )
#define ICU_IER16_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087216 )
#define ICU_IER17_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087217 )
#define ICU_IER18_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087218 )
#define ICU_IER1A_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008721A )
#define ICU_IER1B_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008721B )
#define ICU_IER1C_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008721C )
#define ICU_IER1E_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008721E )
#define ICU_IER1F_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008721F )
#define ICU_IEN0_BIT			        ( 1U << 0U )
#define ICU_IEN1_BIT			        ( 1U << 1U )
#define ICU_IEN2_BIT			        ( 1U << 2U )
#define ICU_IEN3_BIT			        ( 1U << 3U )
#define ICU_IEN4_BIT			        ( 1U << 4U )
#define ICU_IEN5_BIT			        ( 1U << 5U )
#define ICU_IEN6_BIT			        ( 1U << 6U )
#define ICU_IEN7_BIT			        ( 1U << 7U )

/*
 * 割り込み要因プライオリティレジスタi(i=00h～8Fh)の設定
 */
#define ICU_IPR00_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087300 )
#define ICU_IPR01_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087301 )
#define ICU_IPR02_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087302 )
#define ICU_IPR03_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087303 )
#define ICU_IPR04_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087304 )
#define ICU_IPR05_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087305 )
#define ICU_IPR06_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087306 )
#define ICU_IPR07_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087307 )
#define ICU_IPR14_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087314 )
#define ICU_IPR18_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087318 )
#define ICU_IPR20_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087320 )
#define ICU_IPR21_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087321 )
#define ICU_IPR22_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087322 )
#define ICU_IPR23_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087323 )
#define ICU_IPR24_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087324 )
#define ICU_IPR25_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087325 )
#define ICU_IPR26_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087326 )
#define ICU_IPR27_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087327 )
#define ICU_IPR40_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087340 )
#define ICU_IPR44_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087344 )
#define ICU_IPR48_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087348 )
#define ICU_IPR49_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087349 )
#define ICU_IPR51_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087351 )
#define ICU_IPR52_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087352 )
#define ICU_IPR53_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087353 )
#define ICU_IPR54_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087354 )
#define ICU_IPR55_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087355 )
#define ICU_IPR56_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087356 )
#define ICU_IPR57_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087357 )
#define ICU_IPR58_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087358 )
#define ICU_IPR59_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087359 )
#define ICU_IPR5A_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735A )
#define ICU_IPR5B_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735B )
#define ICU_IPR5C_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735C )
#define ICU_IPR5D_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735D )
#define ICU_IPR5E_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735E )
#define ICU_IPR5F_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008735F )
#define ICU_IPR60_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087360 )
#define ICU_IPR67_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087367 )
#define ICU_IPR68_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087368 )
#define ICU_IPR69_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087369 )
#define ICU_IPR6A_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736A )
#define ICU_IPR6B_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736B )
#define ICU_IPR6C_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736C )
#define ICU_IPR6D_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736D )
#define ICU_IPR6E_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736E )
#define ICU_IPR6F_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008736F )
#define ICU_IPR80_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087380 )
#define ICU_IPR81_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087381 )
#define ICU_IPR82_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087382 )
#define ICU_IPR88_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087388 )
#define ICU_IPR89_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087389 )
#define ICU_IPR8A_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008738A )
#define ICU_IPR8B_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008738B )
#define ICU_IPR90_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087390 )
#define ICU_IPR_BIT				        ( 7U << 0U )


