jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 *  IRQコントロールレジスタ
 */
#define ICU_IRQ0_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087500 )
#define ICU_IRQ1_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087501 )
#define ICU_IRQ2_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087502 )
#define ICU_IRQ3_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087503 )
#define ICU_IRQ4_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087504 )
#define ICU_IRQ5_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087505 )
#define ICU_IRQ6_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087506 )
#define ICU_IRQ7_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087507 )
#define ICU_IRQMD_BIT			        ( 3U << 2U )

/*
 *  Non-Maskable Interrupt Enable Register (NMIER)
 */
#define ICU_NMIER_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087581 )
#define ICU_NMIEN_BIT			        ( 1U << 0U )
#define ICU_LVDEN_BIT			        ( 1U << 1U )
#define ICU_OSTEN_BIT			        ( 1U << 2U )

/*
 *  Non-Maskable Interrupt Clear Register (NMICLR)
 */
#define ICU_NMICLR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087582 )
#define ICU_NMICLR_BIT			        ( 1U << 0U )
#define ICU_OSTCLR_BIT			        ( 1U << 2U )

/*
 *  Non-Maskable Interrupt Control Register (NMICR)
 */
#define ICU_NMICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00087583 )
#define ICU_NMIMD_BIT			        ( 1U << 3U )


/*
 *  各チャンネルのレジスタ及び設定ビット情報
 */
#define CMT_CMSTR0_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088000 )
#define CMT_CMSTR0_STR0_BIT		        ( 1U << 0U )
#define CMT_CMSTR0_STR1_BIT		        ( 1U << 1U )
#define CMT_CMSTR1_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088010 )
#define CMT_CMSTR1_STR2_BIT		        ( 1U << 0U )
#define CMT_CMSTR1_STR3_BIT		        ( 1U << 1U )
#define CMT0_CMCR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088002 )
#define CMT0_CMCR_CKS_BIT		        ( 3U )
#define CMT0_CMCR_CMIE_BIT		        ( 1U << 6U )
#define CMT1_CMCR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088008 )
#define CMT1_CMCR_CKS_BIT		        ( 3U )
#define CMT1_CMCR_CMIE_BIT		        ( 1U << 6U )
#define CMT2_CMCR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088012 )
#define CMT2_CMCR_CKS_BIT		        ( 3U)
#define CMT2_CMCR_CMIE_BIT		        ( 1U << 6U )
#define CMT3_CMCR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088018 )
#define CMT3_CMCR_CKS_BIT		        ( 3U )
#define CMT3_CMCR_CMIE_BIT		        ( 1U << 6U )
#define CMT0_CMCNT_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088004 )
#define CMT1_CMCNT_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008800A )
#define CMT2_CMCNT_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088014 )
#define CMT3_CMCNT_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008801A )
#define CMT0_CMCOR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088006 )
#define CMT1_CMCOR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008800C )
#define CMT2_CMCOR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088016 )
#define CMT3_CMCOR_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008801C )

/*
 * Registers of A/D Converter 10bits
 */
#define ADC_ADDRA_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088040 )
#define ADC_ADDRB_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088042 )
#define ADC_ADDRC_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088044 )
#define ADC_ADDRD_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088046 )
#define ADC_ADDRE_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088048 )
#define ADC_ADDRF_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008804A )
#define ADC_ADDRG_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008804C )
#define ADC_ADDRH_ADDR			        ( ( volatile uint16_t __evenaccess * )0x0008804E )
#define ADC_ADDRI_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088060 )
#define ADC_ADDRJ_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088062 )
#define ADC_ADDRK_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088064 )
#define ADC_ADDRL_ADDR			        ( ( volatile uint16_t __evenaccess * )0x00088066 )
#define ADC_ADCSR_ADDR			        ( ( volatile uint8_t __evenaccess *  )0x00088050 )
#define ADC_ADCR_ADDR			        ( ( volatile uint8_t __evenaccess *  )0x00088051 )
#define ADC_ADSSTR_ADDR			        ( ( volatile uint8_t __evenaccess *  )0x0008805B )
#define ADC_ADDIAGR_ADDR		        ( ( volatile uint8_t __evenaccess *  )0x0008805D )
#define ADC_ADSTRGR_ADDR		        ( ( volatile uint8_t __evenaccess *  )0x00088070 )
#define ADC_ADDPR_ADDR			        ( ( volatile uint8_t __evenaccess *  )0x00088072 )
#define ADC_ADST_BIT	                ( 1UL << 5U )

/*
 * Registers of Serial Communications Interface (SCIb)
 */
#define SCI0_SMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088240 )
#define SCI0_BRR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088241 )
#define SCI0_SCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088242 )
#define SCI0_TDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088243 )
#define SCI0_SSR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088244 )
#define SCI0_RDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088245 )
#define SCI0_SCMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088246 )
#define SCI0_SEMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088247 )
#define SCI1_SMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088248 )
#define SCI1_BRR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088249 )
#define SCI1_SCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824A )
#define SCI1_TDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824B )
#define SCI1_SSR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824C )
#define SCI1_RDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824D )
#define SCI1_SCMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824E )
#define SCI1_SEMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008824F )
#define SCI2_SMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088250 )
#define SCI2_BRR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088251 )
#define SCI2_SCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088252 )
#define SCI2_TDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088253 )
#define SCI2_SSR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088254 )
#define SCI2_RDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088255 )
#define SCI2_SCMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088256 )
#define SCI2_SEMR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x00088257 )
#define SCI_SMR_CKS_BIT			        ( 3U << 0U )
#define SCI_SMR_STOP_BIT		        ( 1U << 3U )
#define SCI_SMR_PM_BIT			        ( 1U << 4U )
#define SCI_SMR_PE_BIT			        ( 1U << 5U )
#define SCI_SMR_CHR_BIT			        ( 1U << 6U )
#define SCI_SMR_CM_BIT			        ( 1U << 7U )
#define SCI_SCR_CKE_BIT			        ( 3U << 0U )
#define SCI_SCR_TEIE_BIT		        ( 1U << 2U )
#define SCI_SCR_RE_BIT			        ( 1U << 4U )
#define SCI_SCR_TE_BIT			        ( 1U << 5U )
#define SCI_SCR_RIE_BIT			        ( 1U << 6U )
#define SCI_SCR_TIE_BIT			        ( 1U << 7U )
#define SCI_SSR_TEND_BIT		        ( 1U << 2U )
#define SCI_SSR_PER_BIT			        ( 1U << 3U )
#define SCI_SSR_FER_BIT			        ( 1U << 4U )
#define SCI_SSR_ORER_BIT		        ( 1U << 5U )
#define SCI_SCMR_SMIF_BIT		        ( 1U << 0U )
#define SCI_SCMR_SINV_BIT		        ( 1U << 2U )
#define SCI_SCMR_SDIR_BIT		        ( 1U << 3U )
#define SCI_SCMR_BCP2_BIT		        ( 1U << 7U )
#define SCI_SEMR_ACS0_BIT		        ( 1U << 0U )
#define SCI_SEMR_ABCS_BIT		        ( 1U << 4U )

