jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 *  I/Oポートのレジスタ及び設定ビット情報
 */
#define PORT1_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C001 )
#define PORT2_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C002 )
#define PORT3_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C003 )
#define PORT7_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C007 )
#define PORT8_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C008 )
#define PORT9_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C009 )
#define PORTA_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C00A )
#define PORTB_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C00B )
#define PORTD_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C00D )
#define PORTE_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C00E )
#define PORTG_DDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C010 )
#define PORT_DDR_B0_BIT			        ( 1U << 0U )
#define PORT_DDR_B1_BIT			        ( 1U << 1U )
#define PORT_DDR_B2_BIT			        ( 1U << 2U )
#define PORT_DDR_B3_BIT			        ( 1U << 3U )
#define PORT_DDR_B4_BIT			        ( 1U << 4U )
#define PORT_DDR_B5_BIT			        ( 1U << 5U )
#define PORT_DDR_B6_BIT			        ( 1U << 6U )
#define PORT_DDR_B7_BIT			        ( 1U << 7U )
#define PORT1_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C021 )
#define PORT2_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C022 )
#define PORT3_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C023 )
#define PORT7_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C027 )
#define PORT8_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C028 )
#define PORT9_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C029 )
#define PORTA_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C02A )
#define PORTB_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C02B )
#define PORTD_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C02D )
#define PORTE_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C02E )
#define PORTG_DR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C030 )
#define PORT_DR_B0_BIT			        ( 1U << 0U )
#define PORT_DR_B1_BIT			        ( 1U << 1U )
#define PORT_DR_B2_BIT			        ( 1U << 2U )
#define PORT_DR_B3_BIT			        ( 1U << 3U )
#define PORT_DR_B4_BIT			        ( 1U << 4U )
#define PORT_DR_B5_BIT			        ( 1U << 5U )
#define PORT_DR_B6_BIT			        ( 1U << 6U )
#define PORT_DR_B7_BIT			        ( 1U << 7U )
#define PORT1_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C041 )
#define PORT2_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C042 )
#define PORT3_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C043 )
#define PORT4_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C044 )
#define PORT5_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C045 )
#define PORT6_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C046 )
#define PORT7_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C047 )
#define PORT8_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C048 )
#define PORT9_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C049 )
#define PORTA_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C04A )
#define PORTB_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C04B )
#define PORTD_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C04D )
#define PORTE_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C04E )
#define PORTG_PORT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C050 )
#define PORT_PORT_B0_BIT	            ( 1U << 0U )
#define PORT_PORT_B1_BIT	            ( 1U << 1U )
#define PORT_PORT_B2_BIT	            ( 1U << 2U )
#define PORT_PORT_B3_BIT	            ( 1U << 3U )
#define PORT_PORT_B4_BIT	            ( 1U << 4U )
#define PORT_PORT_B5_BIT	            ( 1U << 5U )
#define PORT_PORT_B6_BIT	            ( 1U << 6U )
#define PORT_PORT_B7_BIT	            ( 1U << 7U )
#define PORT1_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C061 )
#define PORT2_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C062 )
#define PORT3_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C063 )
#define PORT4_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C064 )
#define PORT5_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C065 )
#define PORT6_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C066 )
#define PORT7_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C067 )
#define PORT8_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C068 )
#define PORT9_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C069 )
#define PORTA_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C06A )
#define PORTB_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C06B )
#define PORTD_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C06D )
#define PORTE_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C06E )
#define PORTG_ICR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x0008C070 )
#define PORT_ICR_B0_BIT			        ( 1U << 0U )
#define PORT_ICR_B1_BIT			        ( 1U << 1U )
#define PORT_ICR_B2_BIT			        ( 1U << 2U )
#define PORT_ICR_B3_BIT			        ( 1U << 3U )
#define PORT_ICR_B4_BIT			        ( 1U << 4U )
#define PORT_ICR_B5_BIT			        ( 1U << 5U )
#define PORT_ICR_B6_BIT			        ( 1U << 6U )
#define PORT_ICR_B7_BIT			        ( 1U << 7U )
#define IOPORT_PF8IRQ_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C108 )
#define IOPORT_PF9IRQ_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C109 )
#define IOPORT_PFAADC_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C10A )
#define IOPORT_PFCMTU_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C10C )
#define IOPORT_PFDGPT_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C10D )
#define IOPORT_PFFSCI_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C10F )
#define IOPORT_PFGSPI_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C110 )
#define IOPORT_PFHSPI_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C111 )
#define IOPORT_PFJCAN_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C113 )
#define IOPORT_PFKLIN_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C114 )
#define IOPORT_PFMPOE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C116 )
#define IOPORT_PFNPOE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x0008C117 )
#define PORT_IOPORT_B0_BIT		        ( 1U << 0U )
#define PORT_IOPORT_B1_BIT		        ( 1U << 1U )
#define PORT_IOPORT_B2_BIT		        ( 1U << 2U )
#define PORT_IOPORT_B3_BIT		        ( 1U << 3U )
#define PORT_IOPORT_B4_BIT		        ( 1U << 4U )
#define PORT_IOPORT_B5_BIT		        ( 1U << 5U )
#define PORT_IOPORT_B6_BIT		        ( 1U << 6U )
#define PORT_IOPORT_B7_BIT		        ( 1U << 7U )

