jedsada-us/MFU/01_PIDs_CONTROL_RTOS/asp/arch/rx_rxc/rx62t.h
/*
 * Registers of General Timer (MTU/MTUa)
 */
#define MTU_TSTRA_ADDR			        ( ( volatile uint8_t __evenaccess  * )0x000C1280 )
#define MTU_TSYRA_ADDR			        ( ( volatile uint8_t __evenaccess  * )0x000C1281 )
#define MTU_TCSYSTR_ADDR		        ( ( volatile uint8_t __evenaccess  * )0x000C1282 )
#define MTU_TRWERA_ADDR		            ( ( volatile uint8_t __evenaccess  * )0x000C1284 )
#define MTU0_TCR_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1300 )
#define MTU0_TMDR1_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1301 )
#define MTU0_TIORH_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1302 )
#define MTU0_TIORL_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1303 )
#define MTU0_TIER_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1304 )
#define MTU0_TSR_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1305 )
#define MTU0_TCNT_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C1306 )
#define MTU0_TGRA_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C1308 )
#define MTU0_TGRB_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C130A )
#define MTU0_TGRC_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C130C )
#define MTU0_TGRD_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C130E )
#define MTU0_TGRE_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C1320 )
#define MTU0_TGRF_ADDR    	            ( ( volatile uint16_t __evenaccess * )0x000C1322 )
#define MTU0_TIER2_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1324 )
#define MTU0_TSR2_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1325 )
#define MTU0_TBTM_ADDR    	            ( ( volatile uint8_t __evenaccess  * )0x000C1326 )

/*
 * Registers of General PWM Timer (GPT/GPTa)
 */
#define GPT_GTSTR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2000 )
#define GPT_GTHSCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2004 )
#define GPT_GTHCCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2006 )
#define GPT_GTHSSR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2008 )
#define GPT_GTHPSR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C200A )
#define GPT_GTWP_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C200C )
#define GPT_GTSYNC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C200E )
#define GPT_GTETINT_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2010 )
#define GPT_GTBDR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2014 )
#define GPT_GTSWP_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2018 )
#define GPT_LCCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2080 )
#define GPT_LCST_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2082 )
#define GPT_LCNT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2084 )
#define GPT_LCNTA_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2086 )
#define GPT_LCNT00_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2088 )
#define GPT_LCNT01_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C208A )
#define GPT_LCNT02_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C208C )
#define GPT_LCNT03_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C208E )
#define GPT_LCNT04_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2090 )
#define GPT_LCNT05_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2092 )
#define GPT_LCNT06_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2094 )
#define GPT_LCNT07_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2096 )
#define GPT_LCNT08_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2098 )
#define GPT_LCNT09_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C209A )
#define GPT_LCNT10_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C209C )
#define GPT_LCNT11_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C209E )
#define GPT_LCNT12_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20A0 )
#define GPT_LCNT13_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20A2 )
#define GPT_LCNT14_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20A4 )
#define GPT_LCNT15_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20A6 )
#define GPT_LCNTDU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20A8 )
#define GPT_LCNTDL_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C20AA )
#define GPT0_GTIOR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2100 )
#define GPT0_GTINTAD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2102 )
#define GPT0_GTCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2104 )
#define GPT0_GTBER_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2106 )
#define GPT0_GTUDC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2108 )
#define GPT0_GTITC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C210A )
#define GPT0_GTST_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C210C )
#define GPT0_GTCNT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C210E )
#define GPT0_GTCCRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2110 )
#define GPT0_GTCCRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2112 )
#define GPT0_GTCCRC_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2114 )
#define GPT0_GTCCRD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2116 )
#define GPT0_GTCCRE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2118 )
#define GPT0_GTCCRF_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C211A )
#define GPT0_GTPR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C211C )
#define GPT0_GTPBR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C211E )
#define GPT0_GTPDBR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2120 )
#define GPT0_GTADTRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2124 )
#define GPT0_GTADTBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2126 )
#define GPT0_GTADTDBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2128 )
#define GPT0_GTADTRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C212C )
#define GPT0_GTADTBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C212E )
#define GPT0_GTADTDBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2130 )
#define GPT0_GTONCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2134 )
#define GPT0_GTDTCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2136 )
#define GPT0_GTDVU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2138 )
#define GPT0_GTDVD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C213A )
#define GPT0_GTDBU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C213C )
#define GPT0_GTDBD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C213E )
#define GPT0_GTSOS_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2140 )
#define GPT0_GTSOTR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2142 )
#define GPT1_GTIOR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2180 )
#define GPT1_GTINTAD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2182 )
#define GPT1_GTCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2184 )
#define GPT1_GTBER_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2186 )
#define GPT1_GTUDC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2188 )
#define GPT1_GTITC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C218A )
#define GPT1_GTST_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C218C )
#define GPT1_GTCNT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C218E )
#define GPT1_GTCCRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2190 )
#define GPT1_GTCCRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2192 )
#define GPT1_GTCCRC_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2194 )
#define GPT1_GTCCRD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2196 )
#define GPT1_GTCCRE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2198 )
#define GPT1_GTCCRF_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C219A )
#define GPT1_GTPR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C219C )
#define GPT1_GTPBR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C219E )
#define GPT1_GTPDBR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21A0 )
#define GPT1_GTADTRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21A4 )
#define GPT1_GTADTBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21A6 )
#define GPT1_GTADTDBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21A8 )
#define GPT1_GTADTRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21AC )
#define GPT1_GTADTBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21AE )
#define GPT1_GTADTDBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21B0 )
#define GPT1_GTONCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21B4 )
#define GPT1_GTDTCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21B6 )
#define GPT1_GTDVU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C21B8 )
#define GPT1_GTDVD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C21BA )
#define GPT1_GTDBU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C21BC )
#define GPT1_GTDBD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C21BE )
#define GPT1_GTSOS_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C21C0 )
#define GPT1_GTSOTR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C21C2 )
#define GPT2_GTIOR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2200 )
#define GPT2_GTINTAD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2202 )
#define GPT2_GTCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2204 )
#define GPT2_GTBER_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2206 )
#define GPT2_GTUDC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2208 )
#define GPT2_GTITC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C220A )
#define GPT2_GTST_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C220C )
#define GPT2_GTCNT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C220E )
#define GPT2_GTCCRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2210 )
#define GPT2_GTCCRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2212 )
#define GPT2_GTCCRC_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2214 )
#define GPT2_GTCCRD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2216 )
#define GPT2_GTCCRE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2218 )
#define GPT2_GTCCRF_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C221A )
#define GPT2_GTPR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C221C )
#define GPT2_GTPBR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C221E )
#define GPT2_GTPDBR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2220 )
#define GPT2_GTADTRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2224 )
#define GPT2_GTADTBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2226 )
#define GPT2_GTADTDBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2228 )
#define GPT2_GTADTRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C222C )
#define GPT2_GTADTBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C222E )
#define GPT2_GTADTDBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2230 )
#define GPT2_GTONCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2234 )
#define GPT2_GTDTCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2236 )
#define GPT2_GTDVU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2238 )
#define GPT2_GTDVD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C223A )
#define GPT2_GTDBU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C223C )
#define GPT2_GTDBD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C223E )
#define GPT2_GTSOS_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2240 )
#define GPT2_GTSOTR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2242 )
#define GPT3_GTIOR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2280 )
#define GPT3_GTINTAD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2282 )
#define GPT3_GTCR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2284 )
#define GPT3_GTBER_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2286 )
#define GPT3_GTUDC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C2288 )
#define GPT3_GTITC_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C228A )
#define GPT3_GTST_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C228C )
#define GPT3_GTCNT_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C228E )
#define GPT3_GTCCRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2290 )
#define GPT3_GTCCRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2292 )
#define GPT3_GTCCRC_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2294 )
#define GPT3_GTCCRD_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2296 )
#define GPT3_GTCCRE_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C2298 )
#define GPT3_GTCCRF_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C229A )
#define GPT3_GTPR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C229C )
#define GPT3_GTPBR_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C229E )
#define GPT3_GTPDBR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22A0 )
#define GPT3_GTADTRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22A4 )
#define GPT3_GTADTBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22A6 )
#define GPT3_GTADTDBRA_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22A8 )
#define GPT3_GTADTRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22AC )
#define GPT3_GTADTBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22AE )
#define GPT3_GTADTDBRB_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22B0 )
#define GPT3_GTONCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22B4 )
#define GPT3_GTDTCR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22B6 )
#define GPT3_GTDVU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C22B8 )
#define GPT3_GTDVD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C22BA )
#define GPT3_GTDBU_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C22BC )
#define GPT3_GTDBD_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C22BE )
#define GPT3_GTSOS_ADDR			        ( ( volatile uint8_t __evenaccess * )0x000C22C0 )
#define GPT3_GTSOTR_ADDR		        ( ( volatile uint8_t __evenaccess * )0x000C22C2 )


/*
 *  SERIAL関連の定義
 *
 *  pdicのrx600/rx600_serial.cで使用する．
 */
/*
 *  シリアルI/Oの個数
 */
#define TNUM_SIOP	(1)
#define TNUM_GIOP   (4) /* Number of GPIO port */
#define TNUM_AIOP   (1)  /* Number of ADC port */
#define TNUM_PIOP   (1)  /* Number of PWM port */

#endif	/* TOPPERS_RX62T_H */
